app/Http/Controllers/ImageController.php

    public function index(Request $request){

        if($request->hasFile('image') && count($request->file('image')) > 0){
            foreach($request->file('image') as $file){
                $image = new Image();
                if($file->isValid()){
                    $image->image_name = $file->store('images','public');
                    $image->save();
---
insert into `images` (`image_name`, `updated_at`, `created_at`) values ('images/JtW6KAX1qLVePRDSoPvsiAmbpYs4C2DJTNSgWtk5.jpg', '2025-02-05 16:07:29', '2025-02-05 16:07:29')

    public function create(){

        $images = Image::all()->random(8);
---
select * from `images`

    public function end(){
        $fakeArray = Session::get('fakeArray');
        $points = Session::get('points');

        $endTime = time() - Session::get('timeStart');

        Session::forget('timeStart');

        $this->playerAdd();
        $playerName = Session::get('playerName');

        $players = Player::all()->sortByDesc('points');
---
select * from `players`

    public function playerAdd(){

        $player = Player::all()->where('name', '=',Session::get('playerName'))->first();

        if(Session::get('points') == null){
            Session::put('points', 0);
        }

        if(isset($player)){
            if($player->points < Session::get('points')){
                $player->points = Session::get('points');
            }
            $player->update();
        }
        else{
            $player = new Player();
            $player->name = Session::get('playerName');
            $player->points = Session::get('points');
            $player->save();
---
update `players` set `points` = 4, `players`.`updated_at` = '2025-02-05 16:14:06' where `id` = 11
insert into `players` (`name`, `points`, `updated_at`, `created_at`) values ('Oleg', 0, '2025-02-05 16:11:52', '2025-02-05 16:11:52')

    public function delete($playerName){

        $player = Player::all()->where('name', '=',$playerName)->first();

        $player->delete();
---
delete from `players` where `id` = 11